Revit 2026 API

# CurtainGrid Properties

---

The CurtainGrid type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Grid1Angle | The angle for the U grid line pattern of the curtain grid. |
|  | Grid1Justification | The justification for the U grid line pattern of the curtain grid. |
|  | Grid1Offset | The offset for the U grid line pattern of the curtain grid. |
|  | Grid2Angle | The angle for V grid line pattern of the curtain grid. |
|  | Grid2Justification | The justification for the V grid line pattern of the curtain grid. |
|  | Grid2Offset | The offset for V grid line pattern of the curtain grid. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | NumPanels | The number of panels. |
|  | NumULines | Get the number of grid lines in the U direction. |
|  | NumVLines | Get the number of grid lines in the V direction. |

#### Reference

CurtainGrid Class

Autodesk.Revit.DB Namespace